# --------------------------------- Задача 1. -------------------------------- #
# Да се напише програма, която сортира в нарастващ ред списък, чиито елементи
# са tuples. При сортирането да се взема предвид последният елемент във всеки tuple. В списъкът не трябва да се съдържат празни tuples.

# Вход: [(2, 5), (1, 2), (4, 4), (2, 3), (2, 1)]
# Изход: [(2, 1), (1, 2), (2, 3), (4, 4), (2, 5)]

numbers = [(2, 5), (1, 2), (4, 4), (2, 3), (2, 1)]

def sort_func(el):
	return el[-1]

numbers.sort(key=sort_func)
print(numbers)







