# --------------------------------- Задача 1. -------------------------------- #
# Създайте стринг, който да се казва school и да съдържа името на вашето училище. Използвате
# методите, които научихте за да промените стринга. Ако е необходимо използвайте help функцията.

# school = 'netIT'
# print( school.replace('t','w') )
# print( school )

# help( ''.replace )


# --------------------------------- Задача 2. -------------------------------- #
# Създайте стринг, който да се казва country и присвоете на него стойност “usa”. Създайте нов стринг, correct_country, чиято стойност да е държавата само с големи букви, като използвате някой от стринг методите.
# country='usa'
# correct_country = country.upper()
# print(correct_country)



# Задача 3. Създайте стринг,  filename и му присвоете стойност “hello.py”.
# Проверете дали стринга завършва на “.java”
# filename = 'hello.py.java'
# res = filename.endswith('.java')
# print(res)

# Проверете и дали думата започва с ”world”
# filename = 'hello.py.java'
# res = filename.startswith('hello')
# print(res)

