# Задача 7. Напишете програма, която прилага бонус точки към дадени точки в интервала [1..9]
# чрез прилагане на следните правила:
# - Ако точките са между 1 и 3, програмата ги умножава по 10.
# - Ако точките са между 4 и 6, ги умножава по 100.
# - Ако точките са между 7 и 9, ги умножава по 1000.
# - Ако точките са 0 или повече от 9, се отпечатва съобщение за грешка.


try:
    user_input = input('Въведете цяло число: ')
    number = int(user_input)

    if 1 <= number <= 3:
        result = number * 10
        print(f'Резултата е {result}')
    elif 4 <= number <= 6:
        result = number * 100
        print(f'Резултата е {result}')
    elif 7 <= number <= 9:
        result = number * 1000
        print(f'Резултата е {result}')
    else:
        print('Въведеното число не е между 1 и 9')
except ValueError:
    print('Въведете валидно число')


